function [sys,x0,str,ts] = myTrajectory(t, x, u, flag)
switch flag,
  case 0,
    [sys,x0,str,ts]=mdlInitializeSizes;  % 调用初始化子函数
  case 1,
    sys=[];
  case 2,
    sys=[];
  case 3,
    sys=mdlOutputs(t,x,u);    %计算输出子函数
  case 4,
    sys=[];   %计算下一仿真时刻子函数
  case 9,
    sys=[];    %终止仿真子函数
  otherwise
    DAStudio.error('Simulink:blocks:unhandledFlag', num2str(flag));

end

function [sys,x0,str,ts,simStateCompliance]=mdlInitializeSizes   %初始化子函数

sizes = simsizes;

sizes.NumContStates  = 0;  %连续状态变量个数
sizes.NumDiscStates  = 0;  %离散状态变量个数
sizes.NumOutputs     = 6;  %输出变量个数
sizes.NumInputs      = 0;   %输入变量个数
sizes.DirFeedthrough = 0;   %输入信号是否在输出子函数中出现
sizes.NumSampleTimes = 0;   % at least one sample time is needed

sys = simsizes(sizes);
x0  = [];   %初始值
str = [];   
ts  = [];   %[0 0]用于连续系统，[-1 0]表示继承其前的采样时间设置
simStateCompliance = 'UnknownSimState';

function sys=mdlOutputs(t,x,u)   %计算输出子函数
%%给定
%角度给定
R1 = (0.2122)*sin((0.07145)*t + (-0.2929)) + (0.02808)*sin((0.4551)*t + (-0.6885)) + (0.03361)*sin((0.3328)*t + (3.262)) + (0.08461)*sin((0.2392)*t + (-4.276)) + (0.003794)*sin((0.7906)*t + (0.9682)) + (0.004144)*sin((0.6226)*t + (3.124)) + (0.001227)*sin((1.399)*t + (1.31));
R2 = (0.03998)*sin((0.1579)*t + (-2.991)) + (0.01384)*sin((0.07885)*t + (3.067)) + (0.008931)*sin((0.4724)*t + (-0.04673)) + (0.005905)*sin((0.6298)*t + (1.467)) + (0.001464)*sin((0.7873)*t + (0.2315)) + (0.0009553)*sin((0.3137)*t + (-2.039)) + (0.0005246)*sin((1.102)*t + (0.4585));
R3 = (0.2901)*sin((0.07293)*t + (0.4957)) + (0.04641)*sin((0.4405)*t + (-1.95)) + (0.09683)*sin((0.2138)*t + (4.767)) + (-0.001061)*sin((0.8705)*t + (-8.062)) + (0.007977)*sin((0.7422)*t + (3.05)) + (-0.001536)*sin((1.419)*t + (-7)) + (-0.002239)*sin((1.108)*t + (-5.639));
R4 = (0.9324)*sin((0.06601)*t + (-0.323)) + (0.7436)*sin((0.2437)*t + (1.239)) + (0.6775)*sin((0.3191)*t + (-3.114)) + (0.4589)*sin((0.5866)*t + (-1.384)) + (0.2406)*sin((0.4374)*t + (-1.809)) + (0.3416)*sin((0.6084)*t + (1.528)) + (0.007143)*sin((0.935)*t + (-1.08));
R5 = (0.3727)*sin((0.07814)*t + (-3.077)) + (0.02052)*sin((0.4522)*t + (1.43)) + (0.01501)*sin((0.2963)*t + (0.6598)) + (0.06308)*sin((0.6122)*t + (-0.8979)) + (0.04859)*sin((0.6365)*t + (1.819)) + (-0.001081)*sin((0.8956)*t + (0.05527)) + (0.001443)*sin((1.386)*t + (-0.7095));
R6 = (0.9288)*sin((0.06625)*t + (2.786)) + (0.7397)*sin((0.2484)*t + (-2.053)) + (0.9237)*sin((0.3339)*t + (-0.2747)) + (0.1309)*sin((0.5835)*t + (1.343)) + (0.4342)*sin((0.3898)*t + (1.979)) + (0.04266)*sin((0.6936)*t + (3.03)) + (0.009599)*sin((0.9341)*t + (1.875));

R = [R1; R2; R3; R4; R5; R6];


sys(1) = R(1);
sys(2) = R(2);
sys(3) = R(3);
sys(4) = R(4);
sys(5) = R(5);
sys(6) = R(6);
